/*
  Localizable.strings
  Twingate

  Created by Corey Werner on 23/01/2020.
  Copyright © 2020 com.twingate. All rights reserved.
*/

// MARK: - Alert

"alert.error.title.connect" = "Could Not Connect";
"alert.error.message" = "Twingate ran into a problem trying to %@. Try again or contact support@twingate.com.";
"alert.error.action.connect" = "connect";

"alert.unconnectable.title" = "Unable to Connect";
"alert.unconnectable.message.unresolvable" = "Unable to resolve %@: please verify that your DNS and network configuration allows access to %@.";
"alert.unconnectable.message.vpn" = "We have detected that another VPN connection is active. Please close that connection before connecting to Twingate.";
"alert.unconnectable.action" = "Connect Anyway";

// MARK: - Common

"common.allow" = "Allow";
"common.back" = "Back";
"common.cancel" = "Cancel";
"common.close" = "Close";
"common.continue" = "Continue";
"common.ok" = "OK";
"common.reset" = "Reset";
"common.update" = "Update";

"common.copyright" = "©%@ Twingate";

// MARK: - Connect View Controller

"connect.button.other" = "Sign in to Connect";
"connect.help.generic" = "Connect using the email where you received an invite";
"connect.wait.title" = "Connecting...";
"connect.wait.message.simple" = "You will soon be asked to sign in";

// MARK: - Connection

"connection.error.vpn_config.title" = "Twingate requires VPN Configurations, try again.";
"connection.error.unexpected.title" = "Unexpected network error. Try again or contact support.";
"connection.status.authenticated" = "Authenticated";
"connection.status.authenticating" = "Authenticating...";
"connection.status.authenticate" = "Authenticate";
"connection.status.failed" = "Authentication failed";

// MARK: - Education

"education.title1" = "Remote work, secured.";
"education.subtitle1" = "Twingate allows you to securely connect to the programs and applications your team uses to get work done.";
"education.title2" = "Secure doesn’t mean slow.";
"education.subtitle2" = "Twingate only redirects traffic destined for these applications so your regular traffic is unaffected.";
"education.title3" = "Secure, even on public Wi-Fi.";
"education.subtitle3" = "Secure DNS encrypts your public traffic so you’re safe, even on the public Wi-Fi at your favorite coffee shop.";

// MARK: - Install VPN

"install_vpn.title" = "VPN Configurations";
"install_vpn.subtitle" = "For Twingate to work, it needs to add VPN configurations to your device.";
"install_vpn.allow" = "Allow VPN Configurations";
"install_vpn.error.title" = "Problem Installing VPN";
"install_vpn.error.action" = "install the VPN profile";

// MARK: - Jailbreak

"jailbreak.error.message" = "You're unable to use this app with a Jailbroken device.";
"jailbreak.error.title" = "Jailbroken Device";

// MARK: - Join Network View Controller

"join_network.title" = "Join a Network";
"join_network.title_mac" = "Connect to a Network";
"join_network.subtitle" = "Enter the network name you received in your welcome email";
"join_network.start_on_login" = "Connect to this network on Login";
"join_network.join_on_startup" = "Join on Startup";
"join_network.button.continue" = "Join Network";

"join_network.error.network_not_found" = "Network not found";
"join_network.error.cant_join_network" = "Could not join network";
"join_network.error.save_failed" = "Can't save settings. Please try again later.";
"join_network.error.special_characters" = "Networks can contain only alphanumeric characters.";
"join_network.error.enter_network" = "Please enter a network";

// MARK: - Menu Bar

"menu_bar.update.mandatory" = "Update Twingate (required)";
"menu_bar.update.optional" = "Update Twingate";

"menu_bar.notifications.elevated_access" = "Additional Authentication Needed...";

"menu_bar.connection.join_network" = "Join Network";
"menu_bar.connection.network_error" = "Network Error";
"menu_bar.connection.connect_to" = "Log in to %@...";
"menu_bar.connection.connecting" = "Log in to %@...";
"menu_bar.connection.connected_to" = "Logged in to %@";
"menu_bar.connection.disconnect" = "Log Out & Disconnect";

"menu_bar.more" = "More";
"menu_bar.more.change_network" = "Change Network...";
"menu_bar.more.admin_console" = "Admin Console...";
"menu_bar.more.launch_app" = "Start at Login";
"menu_bar.more.how_twingate_works" = "How Twingate Works...";
"menu_bar.more.doc" = "Documentation...";
"menu_bar.more.terms" = "Terms of Service...";
"menu_bar.more.privacy" = "Privacy Policy...";
"menu_bar.more.open_source" = "Open Source Attribution...";

"menu_bar.resources.all_resources" = "All Resources";
"menu_bar.resources.favorites" = "Favorites";
"menu_bar.resources.total.single" = "Resource";
"menu_bar.resources.total.plural" = "Resources";

"menu_bar.resources.background.total.single" = "Background Resource";
"menu_bar.resources.background.total.plural" = "Background Resources";

"menu_bar.resource.alias_title" = "%@ (alias)";
"menu_bar.resource.copy" = "Copy Address";
"menu_bar.resource.open_browser" = "Open in Browser...";
"menu_bar.resource.admin" = "Open in Admin Console...";

"menu_bar.resource.auth_required" = "Authentication required";
"menu_bar.resource.auth_expires_in" = "Auth expires in ";
"menu_bar.resource.over_a_week" = "over a week";
"menu_bar.resource.less_than_minute" = "under 1 minute";
"menu_bar.resource.authenticate_ellipsis" = "Authenticate...";
"menu_bar.resource.authenticate" = "Authenticate";
"menu_bar.resource.add_to_favorites" = "Add to Favorites";
"menu_bar.resource.remove_from_favorites" = "Remove from Favorites";

"menu_bar.troubleshoot" = "Troubleshoot";
"menu_bar.troubleshoot.copy_version" = "Copy Version Details";
"menu_bar.troubleshoot.crash_reports" = "Share Crash Reports";
"menu_bar.troubleshoot.collect_logs" = "Collect Detailed Logs";
"menu_bar.troubleshoot.share_logs" = "View Logs";
"menu_bar.troubleshoot.report_issue" = "Report an Issue...";

"menu_bar.footer.quit" = "Quit";

// MARK: - Alerts

"alert.upload_logs_error.title" = "Something went wrong...";
"alert.upload_logs_error.text" = "If this happens again, please click learn more to view our troubleshooting guide.";
"alert.upload_logs_error.left" = "Learn more";
"alert.upload_logs_error.right" = "Try Again";

"alert.upload_logs.title" = "Upload diagnostic logs.";
"alert.upload_logs.text" = "To create a support ticket Twingate needs to upload diagnostic logs from this device.";
"alert.upload_logs.action" = "Create ticket";

"alert.quit_during_logs_upload.title" = "Are you sure you want to quit \"Twingate\"?";
"alert.quit_during_logs_upload.text" = "Twingate is uploading diagnotic logs. Quitting will prevent these logs from being uploaded";
"alert.quit_during_logs_upload.action" = "Quit Anyway";

// MARK: - Notifications View Controller

"notifications.title.firstTime" = "Allow Notifications";
"notifications.title.nextTimes" = "Re-enable Notifications";
"notifications.subtitle" = "Twingate will notify you when a resource you are trying to access needs additional authentication";
"notifications.button.continue" = "Allow Notifications";
"notifications.button.skip" = "Not Now";

// MARK: - Privacy View Controller

"privacy.main.title" = "Your Privacy Comes First";
"privacy.title" = "Welcome to Twingate";
"privacy.subtitle" = "Your privacy comes first";
"privacy.body" = "Twingate connects you to resources administered by your organization or team. Twingate’s technology is “zero knowledge,” which means that the contents of data transiting our service is encrypted and we do not inspect it.\n\nThis app collects incidental metadata while you are connected to ensure the quality and reliability of our service and to help us to improve the service, such as device information (e.g. IP addresses, OS version), and timestamps of when your device connects to the service. It also collects information at the direction of your organization or team so they can administer your access to their resources.\n\nTo connect to and use Twingate, you must install a VPN profile on your device.";
"privacy.legal" = "By continuing, you agree to the %@ and acknowledge the %@.";
"privacy.legal.pre-terms" = "By continuing you agree to the ";
"privacy.legal.terms" = "User Terms of Service";
"privacy.legal.pre-privacy-left" = " and";
"privacy.legal.pre-privacy-right" = "acknowledge the ";
"privacy.legal.privacy" = "Privacy Policy";
"privacy.button.accept" = "Accept and Continue";
"privacy.logs.left" = "Enable diagnostic logs";
"privacy.logs.right" = " to help resolve any potential support issues. ";
"privacy.logs.bottom" = "Logs will only be shared if you create a support request.";
"privacy.toogle" = "Enable diagnostic logs";

// MARK: - Permissions View Controller

"permissions.title" = "Set up Twingate";
"permissions.notifications.title" = "Allow Notifications";
"permissions.notifications.desc" = "Allows Twingate to send you authentication prompts. Strongly recommended for the best experience.";
"permissions.notifications.allowed" = "✓ Allowed";
"permissions.notifications.skipped" = "✗ Skipped";
"permissions.vpn.title" = "Configure VPN";
"permissions.vpn.desc" = "Allows Twingate to configure a VPN profile on your device. This is required for Twingate to function.";
"permissions.vpn.pending" = "— Not configured";
"permissions.vpn.allowed" = "✓ Configured";
"permissions.section.button" = "Request Permission";
"permissions.button.continue" = "Continue";

// MARK: - Resources View Controller

"resources.disconnect" = "DISCONNECT";
"resources.connected.title" = "Connected";
"resources.connected.message" = "You can now access resources on your private network";
"resources.empty.title" = "No Resources";
"resources.empty.message" = "It looks like your admin hasn’t given you access to any %@ resources";
"resources.action.copy" = "Copy Address";
"resources.action.copy_original" = "Copy Original Address";
"resources.action.open.browser" = "Open in Browser";
"resources.action.open.chrome" = "Open in Chrome";
"resources.action.open.safari" = "Open in Safari";
"resources.segment.favorites" = "Favorites";
"resources.segment.all" = "All";

// MARK: - Settings View Controller

"settings.row.update" = "Update Twingate";
"settings.row.notifications" = "Allow Notifications";
"settings.row.change" = "Change Network";
"settings.row.privacy" = "Privacy Policy";
"settings.row.terms" = "Terms of Service";
"settings.row.open_source" = "Open Source Attribution";
"settings.row.crashes" = "Share Crash Reports";
"settings.row.logs" = "Collect Detailed Logs";
"settings.row.share" = "Share with Developer";

"settings.error.change.title" = "Could Not Disconnect";
"settings.error.change.action" = "disconnect";

// MARK: - Update View Controller

"update.title" = "Update Twingate";
"update.subtitle" = "This version of Twingate is out of date. Update Twingate to continue securely accessing your resources.";

// MARK: - User Notification

"user_notification.elevated_access.banner.body" = "Click to proceed";
"user_notification.elevated_access.alert.body" = "Click allow to proceed";
"user_notification.elevated_access.body" = "Authenticate to continue";
"user_notification.elevated_access.title" = "Additional Authentication Needed";
"user_notification.versions.body" = "This version of Twingate is out of date. Update Twingate to continue securely accessing your resources.";
"user_notification.versions.title" = "Time to update";
